function first(callback) {
    console.log("okay");
    callback();


};

function whatIsCallback() {
    console.log(`
        Колбек - це функція яка є аргументом іншої функції та викликаються пізніше, після завершення певної операції.
        Основний принцип роботи: 
        - Передажмо функцію-колбек як аргумент іншій функції.
        - Ця функція викликає переданий колбек після завершення певної асинхронної дії.
        Колбеки корисні, тому що дозволяють виконувати інші дії не чекаючи завершення асинхронної дії.`);
};

first(whatIsCallback);