//ЗАВДАННЯ 1
/*
Процедурне програмування - підхід до написання коду, заснований на використанні процедур, функцій і підпрограм. 
Воно описує програми у вигляді послідовності операцій, які виконуються по порядку.
Обєктно-орієнтоване програмування - розглядає програму як множину обєктів, що взаємодіють між собою.


Переваги ООП: 
можна розширювати код завдяки успадкування та поліморфізму.
Дані інкапсульовані в обєктах.

Переваги ПП: 
функції та процедури розділені заьзавданнями.
Швидке виконання через низький рівень абстракції.
Зрозуміло для початківців.


Недоліки ООП:
Виконується трохи повільніше через високий рівень абстракції.
Складніший для новачків, потрібен деякий досвід у написані коду.

Недоліки ПП: 
Здебільшого використовуються глобальні змінні.
Обмежена розширюваність коду через відсутність успадкування.
*/

class Person {
    constructor(name, age, gender) {
        this.name = name;
        this.age = age;
        this.gender = gender;
    }
    greet() {
        console.log(`Привіт ${this.name}`);
    }
}

const woman = new Person("Іванка", 22, "woman");
const man = new Person("Олександр", 25, "man");
woman.greet();
man.greet();